os-install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-17 周日 22:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OS安装与基本配置</title>
<meta name="generator" content="Org mode" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
      <link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://ycode.org"> HOME </a>
</div><div id="content">
<h1 class="title">OS安装与基本配置</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#win">1. <span class="todo TODO">TODO</span> Windows</a>
<ul>
<li><a href="#org7fe4f41">1.1. 安装Windows 7/10</a></li>
<li><a href="#org901256b">1.2. 配置Win10</a>
<ul>
<li><a href="#org46ba21d">1.2.1. 禁止Win+g弹出游戏录制工具栏提示</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#linux">2. <span class="todo TODO">TODO</span> Linux</a>
<ul>
<li><a href="#linux-debian">2.1. <span class="todo TODO">TODO</span> Debian</a>
<ul>
<li><a href="#debian-install">2.1.1. 安装</a></li>
<li><a href="#org6479bf8">2.1.2. 配置</a></li>
</ul>
</li>
<li><a href="#orgcfafc7d">2.2. <span class="todo TODO">TODO</span> LFS</a></li>
</ul>
</li>
<li><a href="#partition">3. <span class="todo TODO">TODO</span> Partition</a></li>
<li><a href="#usb-stick">4. <span class="todo TODO">TODO</span> 随身USB盘</a>
<ul>
<li><a href="#org68b1412">4.1. 工作原理</a></li>
<li><a href="#orga07818b">4.2. 制作方式</a>
<ul>
<li><a href="#org8b9f23d">4.2.1. 分区</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb66b493" class="outline-2">
<h2 id="win"><a id="orgb66b493"></a><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Windows</h2>
<div class="outline-text-2" id="text-win">
</div>
<div id="outline-container-org7fe4f41" class="outline-3">
<h3 id="org7fe4f41"><span class="section-number-3">1.1</span> 安装Windows 7/10</h3>
<div class="outline-text-3" id="text-1-1">
<p>
新的设备一般不再提供CD/DVD驱动器, 而只有USB接口. <a href="https://www.microsoft.com/zh-cn/download/windows-usb-dvd-download-tool">Windows USB DVD Download Tool</a>是
微软提供的USB安装盘制作工具. USB盘分区复杂或异常可能导致引导失败. 最简单可靠的
分区是只保留一个分区, 格式化为NTFS. 如果想用一个大容量USB制作随身USB盘, 请参考
<a href="#usb-stick">随身USB盘</a>.
</p>

<p>
Win7/Win10在安装时会自动生成一个小的隐藏分区, 存放引导文件. 对分区无特殊规划的
用户, 这不会有问题. 如果要控制分区方式, 需安装前完成分区, 此时Win7/Win10把引导
分区内容放置到系统分区内(C盘). 定制分区参见<a href="#partition">Partition</a>.
</p>

<p>
Win单系统安装十分简单. 制作USB安装盘, (可选的)准备分区, 接入USB盘开机, 配置BIOS
或使用F12(部分硬件可能是F9~F12的其他键), 用USB引导安装.
</p>

<p>
Win/Linux双系统参考<a href="#partition">Partition</a>分区. 先安装Win系统, 完成后安装Linux系统, 设置GRUB
引导两个系统. 参见<a href="#debian-install">Debian Install</a>.
</p>
</div>
</div>

<div id="outline-container-org901256b" class="outline-3">
<h3 id="org901256b"><span class="section-number-3">1.2</span> 配置Win10</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org46ba21d" class="outline-4">
<h4 id="org46ba21d"><span class="section-number-4">1.2.1</span> 禁止Win+g弹出游戏录制工具栏提示</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Autohotkey配置 <code>Win+g</code> google搜索剪贴板内容，不希望弹出提示栏；</li>
<li>配置方法：开始-&gt;设置-&gt;游戏-&gt;关掉“使用游戏栏记录游戏剪辑、屏幕截图和广播”。</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org0454cc5" class="outline-2">
<h2 id="linux"><a id="org0454cc5"></a><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Linux</h2>
<div class="outline-text-2" id="text-linux">
</div>
<div id="outline-container-org102953b" class="outline-3">
<h3 id="linux-debian"><a id="org102953b"></a><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Debian</h3>
<div class="outline-text-3" id="text-linux-debian">
</div>
<div id="outline-container-org555663d" class="outline-4">
<h4 id="debian-install"><a id="org555663d"></a><span class="section-number-4">2.1.1</span> 安装</h4>
<div class="outline-text-4" id="text-debian-install">
<p>
使用<a href="https://unetbootin.github.io/">unetbootin</a>制作USB安装盘, U盘引导安装.
</p>

<p>
使用Win/Linux双系统配置的, 执行~update-grub~更新配置文件, 手动修改=defaults=
设置默认操作系统.
</p>
</div>
</div>

<div id="outline-container-org6479bf8" class="outline-4">
<h4 id="org6479bf8"><span class="section-number-4">2.1.2</span> 配置</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ol class="org-ol">
<li><a id="orgc12ba0c"></a>Apt-Source配置<br />
<div class="outline-text-5" id="text-2-1-2-1">
<p>
配置 <code>/etc/apt/sources.list</code>:
</p>
<div class="org-src-container">
<pre class="src src-conf">deb http://httpredir.debian.org/debian jessie main contrib non-free
#deb http://ftp.us.debian.org/debian/dists/jessie jessie main contrib
deb-src http://httpredir.debian.org/debian jessie main contrib non-free

deb http://httpredir.debian.org/debian jessie-updates main contrib non-free
deb-src http://httpredir.debian.org/debian jessie-updates main contrib non-free

deb http://security.debian.org/ jessie/updates main contrib non-free
deb-src http://security.debian.org/ jessie/updates main contrib non-free
</pre>
</div>
<p>
执行更新和安装:
</p>
<div class="org-src-container">
<pre class="src src-shell">~$ sudo apt-get update
~$ sudo apt-get install vim
</pre>
</div>
</div>
</li>

<li><a id="org0b167b5"></a>Thinkpad Trackpoint(小红点)配置<br />
<div class="outline-text-5" id="text-2-1-2-2">
<p>
<a href="https://wiki.debian.org/InstallingDebianOn/Thinkpad/Trackpoint">Debian WIKI</a>中配置介绍, 不同Debian配置方式有差异. 示例如下:
</p>
<div class="org-src-container">
<pre class="src src-shell">~$ uname -a
Linux t400 3.16.0-4-amd64 <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">1 SMP Debian 3.16.43-2 (2017-04-30) x86_64 GNU/Linux</span>
~$ su
~# cat &gt; /usr/share/X11/xorg.conf.d/20-thinkpad.conf.1 &lt;&lt;EOF
<span style="font-weight: bold;">&gt;  Section "InputClass"</span>
<span style="font-weight: bold;">&gt;      Identifier "Trackpoint Wheel Emulation"</span>
<span style="font-weight: bold;">&gt;      MatchProduct       "TPPS/2 IBM TrackPoint|DualPoint Stick|Synaptics Inc. Composite TouchPad / TrackPoint|ThinkPad USB Keyboard with TrackPoint|ThinkPad Compact USB Keyboard with TrackPoint|USB Trackpoint pointing device"</span>
<span style="font-weight: bold;">&gt;      MatchDevicePath    "/dev/input/event*"</span>
<span style="font-weight: bold;">&gt;      Option             "EmulateWheel"          "true"</span>
<span style="font-weight: bold;">&gt;      Option             "EmulateWheelButton"    "2"</span>
<span style="font-weight: bold;">&gt;      Option             "Emulate3Buttons"       "false"</span>
<span style="font-weight: bold;">&gt;      Option             "XAxisMapping"          "6 7"</span>
<span style="font-weight: bold;">&gt;      Option             "YAxisMapping"          "4 5"</span>
<span style="font-weight: bold;">&gt;  EndSection</span>
<span style="font-weight: bold;">&gt; EOF</span>

<span style="font-weight: bold;"># comment: save all your X11 work and exit, then restart X11</span>
<span style="font-weight: bold;">~# /etc/init.d/gdm3 restart</span>
</pre>
</div>
<p>
<a href="https://wiki.archlinux.org/index.php/TrackPoint">ArchLinux</a>和<a href="http://thinkwiki.org/wiki/How_to_configure_the_TrackPoint">thinkwiki</a>也有介绍. 单击真心不好用. :)
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgcfafc7d" class="outline-3">
<h3 id="orgcfafc7d"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> LFS</h3>
</div>
</div>

<div id="outline-container-orgcb57322" class="outline-2">
<h2 id="partition"><a id="orgcb57322"></a><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Partition</h2>
<div class="outline-text-2" id="text-partition">
</div>
</div>

<div id="outline-container-org6dd799b" class="outline-2">
<h2 id="usb-stick"><a id="org6dd799b"></a><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> 随身USB盘</h2>
<div class="outline-text-2" id="text-usb-stick">
<p>
随身携带一个大容量USB(32G/64G), 包含完整可引导的操作系统, 以及Debian, Redhat,
CentOS, Win 7, Win 10操作系统的安装包, 在特定环境下直接运行USB系统工作, 或者
解决系统引导异常. 这在开发底层系统, 或对系统做深度定制时是常见的.
</p>
</div>

<div id="outline-container-org68b1412" class="outline-3">
<h3 id="org68b1412"><span class="section-number-3">4.1</span> 工作原理</h3>
<div class="outline-text-3" id="text-4-1">
<p>
用<a href="https://www.gnu.org/software/grub/">GRUB</a>和<a href="https://sourceforge.net/projects/grub4dos/">grub4dos</a>提供多系统引导, 安装Linux到USB盘, 或用<a href="http://www.linuxfromscratch.org/">LFS</a>制作自己的系统.
</p>
</div>
</div>

<div id="outline-container-orga07818b" class="outline-3">
<h3 id="orga07818b"><span class="section-number-3">4.2</span> 制作方式</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org8b9f23d" class="outline-4">
<h4 id="org8b9f23d"><span class="section-number-4">4.2.1</span> 分区</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
使用fdisk分区. part1用做grub, part2用做live linux, part3用做Linux安装系统, part4
是扩展分区, part5/6分别用做win安装盘和win下数据盘. 各分区大小根据USB和安装盘
大小进行随意调整. 如下是64GB USB示例:
</p>
<div class="org-src-container">
<pre class="src src-shell">yanyg@t:~$ sudo fdisk -l /dev/sdc

Disk /dev/sdc: 57.9 GiB, 62109253632 bytes, 121307136 sectors
Units: sectors of 1 * 512 = 512 bytes
Sector size (logical/physical): 512 bytes / 512 bytes
I/O size (minimum/optimal): 512 bytes / 512 bytes
Disklabel type: dos
Disk identifier: 0xcad4ebea

Device     Boot     Start       End  Sectors  Size Id Type
/dev/sdc1            2048  33556479 33554432   16G 83 Linux
/dev/sdc2        33556480  75499519 41943040   20G 83 Linux
/dev/sdc3        75499520  88082431 12582912    6G 83 Linux
/dev/sdc4        88082432 121307135 33224704 15.9G  5 Extended
/dev/sdc5        88084480 100667391 12582912    6G  7 HPFS/NTFS/exFAT
/dev/sdc6       100669440 121307135 20637696  9.9G  7 HPFS/NTFS/exFAT
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
